[
    {
      "_id": "1",
      "course_name":"Learn HTML in 30 minuts",
      
      "category_id": "1",
    
     
      "image_url": "https://i.ibb.co/dLzD8sQ/html-2.jpg",
      "details": "HTML (HyperText Markup Language) is the code that is used to structure a web page and its content. For example, content could be structured within a set of paragraphs, a list of bulleted points, or using images and data tables"
    },
    {
      "_id": "2",
      "course_name":"Html attributes",
      
      "category_id": "1",
    
     
      "image_url": "https://i.ibb.co/nwzwX1K/html-3.jpg",
      "details": "An HTML attribute is a piece of markup language used to adjust the behavior or display of an HTML element. For example, attributes can be used to change the color, size, or functionality of HTML elements"
    },
    {
      "_id": "3",
      "course_name":"Css class & id",
      
      "category_id": "2",
    
     
      "image_url": "https://i.ibb.co/hdGMVvz/css-2.jpg",
      "details": "CSS is the language for describing the presentation of Web pages, including colors, layout, and fonts. It allows one to adapt the presentation to different types of devices, such as large screens, small screens, or printers. CSS is independent of HTML and can be used with any XML-based markup language."
    },
    {
      "_id": "4",
      "course_name":"Colors 0f CSS",
      
      "category_id": "2",
    
     
      "image_url": "https://i.ibb.co/ScQPCCk/css-3.jpg",
      "details": "CSS stands for Cascading Style Sheets.CSS describes how HTML elements are to be displayed on screen, paper, or in other media.CSS saves a lot of work. It can control the layout of multiple web pages all at once.External stylesheets are stored in CSS files"
    },
    {
      "_id": "5",
      "course_name":"Graphic Designer",
      
      "category_id": "3",
    
     
      "image_url": "https://i.ibb.co/PMmgVJC/images.jpg",
      "details": "Graphic designers create visual concepts, using computer software or by hand, to communicate ideas that inspire, inform, and captivate consumers. They develop the overall layout and production design for applications such as advertisements, brochures, magazines, and reports."
    },
    {
      "_id": "6",
      "course_name":"UI Designer",
      
      "category_id": "3",
    
     
      "image_url": "https://i.ibb.co/L5rbRT4/images-1.jpg",
      "details": "A UI/UX designer's job is to create user-friendly interfaces that enable users to understand how to use complex technical products. If you're passionate about the latest technology trends and devices, you'll find great fulfillment in being involved in the design process for the next hot gadget."
    },
    {
        
      "_id": "7",
      "course_name":"Learn Phython",
      
      "category_id": "4",
    
     
      "image_url": "https://i.ibb.co/jJbRTS3/phy-2.jpg",
      "details": "Python is a popular programming language.Python can be used on a server to create web applications.It is used for web development, software development,mathematics etc"
    },
    {
      "_id": "8",
      "course_name":"Magic of phython",
      
      "category_id": "4",
    
     
      "image_url": "https://i.ibb.co/Lkn8sj9/phy-3.png",
      "details": "Python is a popular programming language.Python can be used on a server to create web applications.It is used for web development, software development,mathematics etc"
    },
    {
      "_id": "9",
      "course_name":" Learn Javascript",
      
      "category_id": "5",
    
     
      "image_url": "https://i.ibb.co/mz43h3L/js-1.png",
      "details": "JavaScript is the world's most popular programming language.JavaScript is a text-based programming language used both on the client-side and server-side that allows you to make web pages interactive. Where HTML and CSS are languages that give structure and style to web pages, JavaScript gives web pages interactive elements that engage a user"
    },
    {
      "_id": "10",
      "course_name":"Master of Js",
      
      "category_id": "5",
    
     
      "image_url": "https://i.ibb.co/7gcBrKd/js-3.png",
      "details": "JavaScript is the world's most popular programming language.JavaScript is a text-based programming language used both on the client-side and server-side that allows you to make web pages interactive. Where HTML and CSS are languages that give structure and style to web pages, JavaScript gives web pages interactive elements that engage a user"
    },
    {
      "_id": "11",
      "course_name":"React Router",
      
      "category_id": "6",
    
     
      "image_url": "https://i.ibb.co/kcNXPYq/react-2.jpg",
      "details": "React Router is a standard library for routing in React. It enables the navigation among views of various components in a React Application, allows changing the browser URL, and keeps the UI in sync with the URL"
    },
    {
      "_id": "12",
      "course_name":"React Hooks",
      
      "category_id": "6",
    
     
      "image_url": "https://i.ibb.co/9spPmr0/react-3.png",
      "details": "React Hooks are simple JavaScript functions that we can use to isolate the reusable part from a functional component. Hooks can be stateful and can manage side-effects. React provides a bunch of standard in-built hooks: useState : To manage states. Returns a stateful value and an updater function to update it"
    }
]